app/controllers/home_controller.rb

SELECT `produtos2s`.* FROM `produtos2s` WHERE `produtos2s`.`id` = 4 LIMIT 1
INSERT INTO `produtos2s` (`nome`, `created_at`, `updated_at`) VALUES ('A linguagem de programação ruby', '2025-07-12 14:47:27.913067', '2025-07-12 14:47:27.913067')
UPDATE `produtos2s` SET `produtos2s`.`nome` = 'curso itensivo de mysql2', `produtos2s`.`updated_at` = '2025-07-12 14:50:06.760007' WHERE `produtos2s`.`id` = 4
SELECT `produtos2s`.* FROM `produtos2s`
---
  def index
    @teste = "Raimundo"

    produto = Produto.new
    produto.nome = "Pc Dell Optiplex 360"
    produto.salvar

    #produto = Produto.new
    #produto.id = 4
    #produto.nome = "NotBook Dell"
    #produto.atualizar

    #produto = Produto.new
    #produto.id = 4
    #produto.excluir


    #@produtos = Produto.buscar
    #
    #produto = Produtos2.new
    #produto.nome = "curso itensivo de mysql"
    #produto.save

    produto = Produtos2.find(4)
    produto.nome = "curso itensivo de mysql2"
    produto.save

    @produtos = Produtos2.all