app/controllers/produtos_controller.rb

  def index
    @produtos = Produtos2.all
---
SELECT `produtos2s`.* FROM `produtos2s`